# 04 - Grouping

### Step 1. Import the necessary libraries

In [1]:
import pandas as pd

### Step 2. Import the dataset from this [address](https://raw.githubusercontent.com/justmarkham/DAT8/master/data/u.user).

### Step 3. Assign it to a variable called users.

In [2]:
users = pd.read_table('https://raw.githubusercontent.com/justmarkham/DAT8/master/data/u.user', 
                      sep='|', index_col='user_id')
users

         age gender     occupation zip_code
user_id
1         24      M     technician    85711
2         53      F          other    94043
3         23      M         writer    32067
4         24      M     technician    43537
5         33      F          other    15213
...      ...    ...            ...      ...
939       26      F        student    33319
940       32      M  administrator    02215
941       20      M        student    97229
942       48      F      librarian    78209
943       22      M        student    77841

[943 rows x 4 columns]

### Step 4. Discover what is the mean age per occupation

In [15]:
ageuser = users.copy()
ageuser = ageuser.groupby("occupation").mean()
ageuser2 = ageuser.rename(columns = {'age':'age_mean'}, inplace=False)
ageuser2

                age_mean
occupation
administrator  38.746835
artist         31.392857
doctor         43.571429
educator       42.010526
engineer       36.388060
entertainment  29.222222
executive      38.718750
healthcare     41.562500
homemaker      32.571429
lawyer         36.750000
librarian      40.000000
marketing      37.615385
none           26.555556
other          34.523810
programmer     33.121212
retired        63.071429
salesman       35.666667
scientist      35.548387
student        22.081633
technician     33.148148
writer         36.311111

### Step 5. Discover the Male ratio per occupation and sort it from the most to the least

In [69]:
MaleRatio = users.copy()
MaleRatio = MaleRatio.drop(['age','zip_code'], axis=1)
MaleRatio['Total'] = 1
MaleRatio['Males'] = MaleRatio['gender'].apply(lambda x: 1 if x == 'M' else 0)
MaleRatio = MaleRatio.groupby('occupation').sum()
MaleRatio['Ratio'] = round(MaleRatio['Males']/MaleRatio['Total'],3)
MaleRatio = MaleRatio.sort_values(by='Ratio', ascending=False) 
MaleRatio

               Total  Males  Ratio
occupation
doctor             7      7  1.000
engineer          67     65  0.970
technician        27     26  0.963
retired           14     13  0.929
programmer        66     60  0.909
executive         32     29  0.906
scientist         31     28  0.903
entertainment     18     16  0.889
lawyer            12     10  0.833
salesman          12      9  0.750
educator          95     69  0.726
student          196    136  0.694
other            105     69  0.657
marketing         26     16  0.615
writer            45     26  0.578
none               9      5  0.556
administrator     79     43  0.544
artist            28     15  0.536
librarian         51     22  0.431
healthcare        16      5  0.312
homemaker          7      1  0.143

### Step 6. For each occupation, calculate the minimum and maximum ages

In [52]:
maxminocc = users.copy()
maxminocc = maxminocc.drop(columns=['gender','zip_code'])
maxminocc = maxminocc.groupby('occupation').agg(['min','max'])
maxminocc

              age
              min max
occupation
administrator  21  70
artist         19  48
doctor         28  64
educator       23  63
engineer       22  70
entertainment  15  50
executive      22  69
healthcare     22  62
homemaker      20  50
lawyer         21  53
librarian      23  69
marketing      24  55
none           11  55
other          13  64
programmer     20  63
retired        51  73
salesman       18  66
scientist      23  55
student         7  42
technician     21  55
writer         18  60

### Step 7. For each combination of occupation and gender, calculate the mean age

In [67]:
maxmingen = users.copy()
maxmingen = maxmingen.drop(columns=['zip_code'])
maxmingen = round(maxmingen.groupby(['occupation','gender']).agg('mean'),2)
maxmingen

                        age
occupation    gender
administrator F       40.64
              M       37.16
artist        F       30.31
              M       32.33
doctor        M       43.57
educator      F       39.12
              M       43.10
engineer      F       29.50
              M       36.60
entertainment F       31.00
              M       29.00
executive     F       44.00
              M       38.17
healthcare    F       39.82
              M       45.40
homemaker     F       34.17
              M       23.00
lawyer        F       39.50
              M       36.20
librarian     F       40.00
              M       40.00
marketing     F       37.20
              M       37.88
none          F       36.50
              M       18.60
other         F       35.47
              M       34.03
programmer    F       32.17
              M       33.22
retired       F       70.00
              M       62.54
salesman      F       27.00
              M       38.56
scientist     F       28.33
              M       36.32
student       F       20.75
              M       22.67
technician    F       38.00
              M       32.96
writer        F       37.63
              M       35.35

### Step 8.  For each occupation present the percentage of women and men

In [72]:
genderPer = users.copy()
genderPer = genderPer.drop(['age','zip_code'], axis=1)
genderPer['Total'] = 1
genderPer['gendersM'] = genderPer['gender'].apply(lambda x: 1 if x == 'M' else 0)
genderPer['gendersF'] = genderPer['gender'].apply(lambda x: 1 if x == 'F' else 0)
genderPer = genderPer.groupby('occupation').sum()
genderPer['PerM_%'] = round(genderPer['gendersM']/genderPer['Total']*100)
genderPer['PerF_%'] = round(genderPer['gendersF']/genderPer['Total']*100)
genderPer

               Total  gendersM  gendersF  PerM_%  PerF_%
occupation
administrator     79        43        36    54.0    46.0
artist            28        15        13    54.0    46.0
doctor             7         7         0   100.0     0.0
educator          95        69        26    73.0    27.0
engineer          67        65         2    97.0     3.0
entertainment     18        16         2    89.0    11.0
executive         32        29         3    91.0     9.0
healthcare        16         5        11    31.0    69.0
homemaker          7         1         6    14.0    86.0
lawyer            12        10         2    83.0    17.0
librarian         51        22        29    43.0    57.0
marketing         26        16        10    62.0    38.0
none               9         5         4    56.0    44.0
other            105        69        36    66.0    34.0
programmer        66        60         6    91.0     9.0
retired           14        13         1    93.0     7.0
salesman          12         9         3    75.0    25.0
scientist         31        28         3    90.0    10.0
student          196       136        60    69.0    31.0
technician        27        26         1    96.0     4.0
writer            45        26        19    58.0    42.0